Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G73A.tmx
Source language: en_us
Languages: zh_cn

source: My Mother, Her Secrets
zh_cn: 妈妈不为人知的往事

source: SOME years ago, when I was in my early 20s, I found a photograph of my mother as a bride.
zh_cn: 很多年前，我二十岁刚出头，一天忽然看到母亲一张新娘照片。

source: That the man beside her was not my father, that she'd kept this marriage a secret from me, that she had been disturbingly young - none of this unsettled me as much as her expression.
zh_cn: 站在她一旁的男人并不是我的父亲，这段婚姻她一直没有对我说过。照片上她是那么年轻，有点让人担心，然而最让我感到难安的是照片上她的表情。

source: Eyes downcast and lips pouted, she looked as if the next shot would have shown her crying.
zh_cn: 她眼睛朝下看，嘴角下垂着，好像下一个张照片就是哭泣。

source: In that moment I thought: That is not my mother.
zh_cn: 那一刻我想的是，这不是我母亲。

source: My family left Iran during the 1979 Islamic Revolution.
zh_cn: 1979年伊朗革命期间，我的家人离开了伊朗。

source: My parents bought a roadside motel in California and set out to make new lives for us.
zh_cn: 父母在加州买了一家路边汽车旅馆，开始我们新的生活。

source: Immigration baffled, then broke, my father, and so it was my mother who took charge of the motel, my mother who sat behind the plastic window of the manager's suite answering the phone, my mother who cleaned the rooms on weekends and all the other days when the maid didn't show up.
zh_cn: 移民问题先是给父亲带来许多麻烦，后来又让他破产。这样，母亲就承担起经营旅馆的重担。上班时，母亲坐在经理室套间的塑料窗的后面接听电话，到了周末或者女佣不在的日子，母亲自个打扫所有的房间。

source: At home she was no less commanding.
zh_cn: 在家里，妈妈的威风依旧不减。

source: Here the woman who wrangled with truck drivers over motel bills wore a turquoise bathing cap and bright red lipstick to swim in the backyard pool.
zh_cn: 这位可以与卡车司机为账单高声喊叫的女人，常常带上浅绿色浴帽，涂着鲜艳的口红到后院的浴池游泳。

source: She reigned over dinner parties of 50 or 100 people.
zh_cn: 她张罗50人、甚至100人参加的宴会。

source: She coursed, coiffed and high-heeled, through rooms filled with marble coffee tables, gilt-framed armoires and fields of Persian carpets.
zh_cn: 她裹着头巾，穿高跟鞋，在放满大理石茶几和镀金框的大衣橱、铺着波斯地毯的屋子里走来走去。

source: She stuffed plump dates with almonds and passed them on sterling silver platters, smilingly, to her guests.
zh_cn: 她将杏仁放入又厚又大的枣里，装在纯银盘子上，满带笑容地递给客人。

source: Proud, exacting, self-assured and unsentimental: that was the mother I knew.
zh_cn: 骄傲严谨、充满自信、不露声色，这就是我了解的母亲。

source: Nothing about her resembled the vulnerable girl in the photograph I found, or at least nothing I could yet recognize.
zh_cn: 她的故事根本没有我在照片里看到的那位脆弱姑娘形象，至少在我当时认识到的那些事情里找不到。

source: "For God's sake, make something of yourself!" had been her constant injunction throughout my childhood and adolescence.
zh_cn: “看在真主的份上，做出一番事业来。”童年少年时光里，她经常拿这句话教导我。

source: "Make something of yourself or else you are nothing at all!"
zh_cn: “没有出息，人就会变成窝囊废。”

source: My mother was as protective as she was ambitious.
zh_cn: 母亲是个既有进取心又保守的人。

source: Forbidden even the small liberties enjoyed by the other Iranian girls of our social circle, I spent almost every day with her at the motel or out on visits to her friends.
zh_cn: 她不给我们社交圈里的其他伊朗孩子可以享受的任何哪怕是小小的自由。我只能几乎天天和她在一起，要么呆在汽车旅馆，要么一起探访她的朋友。

source: What I wanted to be - what I wanted to make myself more desperately all the time - was normal.
zh_cn: 我想要的就是无异于别人，这也是我时时刻刻渴望实现的人生目标。

source: By which I meant American.
zh_cn: 换句话说，我想让自己属于美国。

source: I could never understand my mother's anxiety about keeping me close and safe.
zh_cn: 母亲让我保持亲近，担心我的安全，可我永远不理解她的忧虑。

source: As I got older, I simply dismissed her protectiveness as just one of her many strange, foreign ways.
zh_cn: 长大成人后，我一味地把她的保护归咎为一种奇怪、异族生活方式。

source: I moved to the East Coast and spoke to her only infrequently.
zh_cn: 搬到了东海岸后，偶尔才跟她说句话。

source: I cast her as Odious Old World Mother to my Plucky American Heroine and, until I found the photograph, I didn't look back.
zh_cn: 我一直将她看成闯入我《勇敢的美国女英雄》中《令人生厌的旧世界母亲》，见到这张照片以前，我几乎没有回想着过去。

source: It's difficult to imagine our mothers as women with stories and selves that exist separately from ours.
zh_cn: 母亲们拥有与我们自己的截断不同的故事与自我，这一点让人难以想象。

source: So firmly do we hold onto the mothers of our memories that even as adults faced with some irrefutable proof of their lives before and apart from us, we still insist on our own versions of their lives.
zh_cn: 因此，即便我们到了成年，有了她们以前及我们之外生活的确凿证据，我们依然坚持着自己记忆中的母亲，我们依然坚持按照我们自己的理解描绘她们的生活。

source: After I confronted my mother about the photograph, the truth of her life came out haltingly and imperfectly.
zh_cn: 我拿这张照片跟她对质之后，母亲真实的生活才断断续续、支离破碎地展现了出来。

source: Even now, a decade later, there are many parts of it that I don't understand and can't square with my memories of her.
zh_cn: 10年后的今天，母亲生活中的许多部分我依然不了解，与我对她的记忆对不在一块儿。

source: What I do know is that she was married at 13.
zh_cn: 现在我知道，母亲13岁就结婚了。

source: I also know she had a child by her first husband - a daughter - and that she'd been forced to abandon that child as a condition of divorce.
zh_cn: 我还知道她和第一个丈夫有了一个孩子——一个女儿——作为离婚的条件，她被迫放弃了这个孩子。

source: "Don't speak her name," her family had told her, and even after 30 years, even in another country, she feels herself bound by that dictate.
zh_cn: “不能说出这个孩子的名字，”家人曾要求她。30年后，生活在另一个国度的母亲仍然感受到这种要求的束缚。

source: For me, finding the photograph meant giving up not only the idea of my mother I'd held onto for so long, but also giving up some version of the daughter I'd been.
zh_cn: 对我而言，发现这张照片意味着不但放弃了我曾经那么长时间坚持的对母亲的看法，而且放弃了我作为女儿的一些想法。

source: The revelation of her secret made me feel a strange new tenderness toward her, and it would make me kinder to her, if not always kind enough.
zh_cn: 揭开她生活中的秘密使我对她有意一种说不出的新的亲近，也让我对她更加和善了，尽管这种和善总是不够。

source: It also made me remember other things about my mother, memories I'd just about forgotten.
zh_cn: 同时，也让我想起母亲的其它事情，那是几乎就要忘记的记忆。

source: I'd think back, for example, to how she used to sit in the living room by herself late at night, watching television footage of the revolution and, later, of the Iran-Iraq war.
zh_cn: 譬如，我想起了夜里她常常一个人坐在客厅，观看伊朗革命以及后来两伊战争的电视片。

source: As the cries of "Allahu Akbar!" rang out across the rooftops of Tehran, she'd rock herself back and forth, eyes fixed on the screen.
zh_cn: 当整个德黑兰的屋顶上响起了“真主至大”的喊声时，她坐在沙发上前仰后合，眼睛却一个劲盯着屏幕。

source: I'd remember, too, the times when I'd wake up in the night, fumble downstairs and find the light from her bedroom spilling out onto the hallway carpet.
zh_cn: 我还想起了多少次我夜里起来，摸黑下楼梯，看到母亲卧室里的灯光照在楼梯的地毯上。

source: Behind the door I'd hear her sobbing, and it scared me so much I'd climb the stairs and go back to my own bed.
zh_cn: 门的背后，我听见她在哭泣，我吓坏了，连忙爬楼梯回到自己的床上。

source: These two inscrutable histories - Iran's, hers - were wedded to each other, I realized many years later, and I wondered if I'd ever make sense of either one.
zh_cn: 多少年后我才意识到，神秘莫测的伊朗历史和母亲那变幻难料的个人命运紧紧的交织在一起，我不知道自己能不能看懂任何一个。

source: Shortly after I found the photograph, I went to visit her in California.
zh_cn: 发现这张照片后不久，我去加州看望母亲。

source: My father had died, the motel had been sold off, and she'd had to give up her house.
zh_cn: 父亲已经去世，旅馆已经卖给他人，她还有放弃自己的房子。

source: She had less, by far, than what she'd come to America with and no hope of ever returning to Iran.
zh_cn: 与来到美国时相比，属于她的东西更少了，再也没有希望返回伊朗了。

source: As I looked around her tiny studio, I was astonished not so much by what she'd lost, but by what she'd managed to hold on to: her brass samovar, her marble-topped buffet, her canopied bed.
zh_cn: 我四处看着她很小的工作间，感到惊奇地倒不是她丢掉的，而是多年来她一直保留的：铜茶壶，大理石作顶的餐饮台，遮有天蓬的床。

source: Surrounded by these and other hard-won tokens of our American lives, I was suddenly and fiercely grateful to have come back home.
zh_cn: 包围在这样或那样通过艰苦努力而获得的美国生活标记，我突然有了一种回到家里的强烈感激之情。

source: During that visit, my mother showed me another photograph I'd never seen before.
zh_cn: 这次探访中，我母亲又给我看了一张我过去从来没有见到的照片。

source: In it a young woman, hair bobbed and face in shadows, stood with a toddler.
zh_cn: 照片上，一个年轻的女子留着短发，脸部有阴影，和一个小孩站在一起。

source: I studied the photograph closely, quietly, ready finally to know her, or at least to begin.
zh_cn: 我静静地端详着这张照片，终于做好了解她的准备，或者至少准备开始。
